In [7]:
import os
print(os.listdir())

['.conda', '.condarc', '.continuum', '.ipynb_checkpoints', '.ipython', '.jupyter', '.matplotlib', '.vscode', 'anaconda3', 'AppData', 'Application Data', 'cat.py', 'Contacts', 'Cookies', 'Day 8 - Loops.ipynb', 'day-05-dictionaries.ipynb', 'Day10_File_Handling.ipynb', 'Day11_Numpy_Basics.ipynb', 'Day12_Numpy_Advanced.ipynb', 'Day13_Pandas_Series&DataFrames.ipynb', 'Day14_Pandas_Indexing_Filtering_Sorting.ipynb', 'Day1_Basics.ipynb', 'Day2_Data_Types.ipynb', 'day4_tuples.ipynb', 'Day6_Sets.ipynb', 'Day7_Functions_in_Python.ipynb', 'DAY9_Functions_in_Python.ipynb', 'day_3_strings_and_operations.ipynb', 'Day_7_Conditionals.ipynb', 'Desktop', 'Documents', 'Downloads', 'Favorites', 'grade.py', 'hogwarts.py', 'house.py', 'IntelGraphicsProfiles', 'Links', 'Local Settings', 'Music', 'My Documents', 'my_notes.txt', 'NetHood', 'NTUSER.DAT', 'ntuser.dat.LOG1', 'ntuser.dat.LOG2', 'NTUSER.DAT{1c2b59c6-c5f5-11eb-bacb-000d3a96488e}.TM.blf', 'NTUSER.DAT{1c2b59c6-c5f5-11eb-bacb-000d3a96488e}.TMContainer00000000000000000001.regtrans-ms', 'NTUSER.DAT{1c2b59c6-c5f5-11eb-bacb-000d3a96488e}.TMContainer00000000000000000002.regtrans-ms', 'ntuser.ini', 'OneDrive', 'Pictures', 'PrintHood', 'products.csv', 'Recent', 'report.py', 'Saved Games', 'Searches', 'SendTo', 'Start Menu', 'Templates', 'train.csv', 'Untitled.ipynb', 'Untitled1.ipynb', 'Untitled2.ipynb', 'Untitled3.ipynb', 'Videos', 'Zotero']

In [8]:
# Cell 1: Import Pandas and load train.csv
import pandas as pd

# Load Titanic dataset
df = pd.read_csv('train.csv')
# Preview the first 5 rows
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [9]:
# Cell 2: Indexing with .loc and .iloc
# Select 'Name' and 'Age' for rows with index labels 0 to 4 using .loc
loc_subset = df.loc[0:4, ['Name', 'Age']]
print("Using .loc (Name, Age for first 5 rows):\n", loc_subset)

# Select same columns but using integer positions with .iloc
iloc_subset = df.iloc[0:5, [3, 5]]  # Name is column 3, Age is column 5
print("\nUsing .iloc (same subset):\n", iloc_subset)

# Direct column access
names = df['Name']
print("\nFirst 5 names (direct access):\n", names.head())

Using .loc (Name, Age for first 5 rows):
                                                 Name   Age
0                            Braund, Mr. Owen Harris  22.0
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  38.0
2                             Heikkinen, Miss. Laina  26.0
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  35.0
4                           Allen, Mr. William Henry  35.0

Using .iloc (same subset):
                                                 Name   Age
0                            Braund, Mr. Owen Harris  22.0
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  38.0
2                             Heikkinen, Miss. Laina  26.0
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  35.0
4                           Allen, Mr. William Henry  35.0

First 5 names (direct access):
 0                              Braund, Mr. Owen Harris
1    Cumings, Mrs. John Bradley (Florence Briggs Th...
2                               Heikkinen, Miss. Laina
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                             Allen, Mr. William Henry
Name: Name, dtype: object

In [10]:
# Cell 3: Filtering rows
# Passengers older than 25 in first class (Pclass == 1)
filtered = df[(df['Age'] > 25) & (df['Pclass'] == 1)][['Name', 'Age', 'Pclass', 'Fare']]
print("Passengers over 25 in first class:\n", filtered.head())

# Passengers who survived and paid fare > $50
high_fare_survivors = df[(df['Survived'] == 1) & (df['Fare'] > 50)][['Name', 'Fare', 'Survived']]
print("\nSurvivors with fare > $50:\n", high_fare_survivors.head())

Passengers over 25 in first class:
                                                  Name   Age  Pclass     Fare
1   Cumings, Mrs. John Bradley (Florence Briggs Th...  38.0       1  71.2833
3        Futrelle, Mrs. Jacques Heath (Lily May Peel)  35.0       1  53.1000
6                             McCarthy, Mr. Timothy J  54.0       1  51.8625
11                           Bonnell, Miss. Elizabeth  58.0       1  26.5500
23                       Sloper, Mr. William Thompson  28.0       1  35.5000

Survivors with fare > $50:
                                                  Name      Fare  Survived
1   Cumings, Mrs. John Bradley (Florence Briggs Th...   71.2833         1
3        Futrelle, Mrs. Jacques Heath (Lily May Peel)   53.1000         1
31     Spencer, Mrs. William Augustus (Marie Eugenie)  146.5208         1
52           Harper, Mrs. Henry Sleeper (Myna Haxtun)   76.7292         1
61                                Icard, Miss. Amelie   80.0000         1

In [11]:
# Cell 4: Sorting data
# Sort by Fare (descending)
sorted_by_fare = df.sort_values(by='Fare', ascending=False)[['Name', 'Fare', 'Pclass']]
print("Top 5 by Fare (descending):\n", sorted_by_fare.head())

# Multi-level sorting: by Pclass (ascending), then Age (ascending)
multi_sorted = df.sort_values(by=['Pclass', 'Age'], ascending=[True, True])[['Name', 'Pclass', 'Age']]
print("\nSorted by Pclass and Age:\n", multi_sorted.head())

# Sort by index (if index is messy)
index_sorted = df.sort_index()
print("\nFirst 5 rows sorted by index:\n", index_sorted.head())

Top 5 by Fare (descending):
                                    Name      Fare  Pclass
258                    Ward, Miss. Anna  512.3292       1
737              Lesurer, Mr. Gustave J  512.3292       1
679  Cardeza, Mr. Thomas Drake Martinez  512.3292       1
88           Fortune, Miss. Mabel Helen  263.0000       1
27       Fortune, Mr. Charles Alexander  263.0000       1

Sorted by Pclass and Age:
                                     Name  Pclass    Age
305       Allison, Master. Hudson Trevor       1   0.92
297         Allison, Miss. Helen Loraine       1   2.00
445            Dodge, Master. Washington       1   4.00
802  Carter, Master. William Thornton II       1  11.00
435            Carter, Miss. Lucile Polk       1  14.00

First 5 rows sorted by index:
    PassengerId  Survived  Pclass  \
0            1         0       3
1            2         1       1
2            3         1       3
3            4         1       1
4            5         0       3

                                                Name     Sex   Age  SibSp  \
0                            Braund, Mr. Owen Harris    male  22.0      1
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                             Heikkinen, Miss. Laina  female  26.0      0
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
4                           Allen, Mr. William Henry    male  35.0      0

   Parch            Ticket     Fare Cabin Embarked
0      0         A/5 21171   7.2500   NaN        S
1      0          PC 17599  71.2833   C85        C
2      0  STON/O2. 3101282   7.9250   NaN        S
3      0            113803  53.1000  C123        S
4      0            373450   8.0500   NaN        S

In [12]:
# Cell 5: Save filtered/sorted data to CSV
filtered.to_csv('titanic_filtered_day14.csv', index=False)
print("Filtered data saved to 'titanic_filtered_day14.csv'")

Filtered data saved to 'titanic_filtered_day14.csv'

In [16]:
#Practice Exercises
#Filter passengers where Fare > 100 and Survived == 1, sort by Age (ascending), and select Name, Age, Fare
filter = df[(df["Fare"] > 100) & (df["Survived"] == 1)][["Name", "Age", "Fare"]]
sort = filter.sort_values("Age", ascending = True)
sort.to_csv('titanic_practice_day14.csv', index=False)
print("Practice: Survivors with Fare > $100, sorted by Age:\n", sort.head())

Practice: Survivors with Fare > $100, sorted by Age:
                                     Name    Age      Fare
305       Allison, Master. Hudson Trevor   0.92  151.5500
802  Carter, Master. William Thornton II  11.00  120.0000
435            Carter, Miss. Lucile Polk  14.00  120.0000
689    Madill, Miss. Georgette Alexandra  15.00  211.3375
550          Thayer, Mr. John Borland Jr  17.00  110.8833